WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
/****************************************************************************
 * nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
 * 
 *   Copyright (C) 2024 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/
// This module, uses timers to calculate frequency

// The Problem with 16-bit timers.
// At certain input frequencies the CNT being cleared and the CNT overflow
// are reported in the same interrupt. However, there is only 1 bit available
// to indicate both conditions.
// The highest frequency this occurs at is TimerClock/65536, which is
// 1,464.844 Hz with a timer clock of 96 MHz. This reoccurs at the intervals
// (TimerClock/65536)/2, (TimerClock/65536)/3 etc.
// More details.
// For most input frequencies, on a leading (e.g. rising) or trailing (e.g.
// falling) edge an interrupt is generated containing the CC1IF (leading) or
// CC2IF (trailing) flags set. The UIF flag is always set with the CC1IF
// flag, to indicate that the CNT register has been cleared. However, at
// some frequencies, the overflow and the CNT reset occur at the same moment.
// The UIF is set but it cannot be determined if it indicates CNT overflow or
// CNT reset.

// ToDo List
// x1. Add a running average feature. It would be the average since the last
//  reading.
// x2. Add count of the input GPIO trailing edges since last reading.
// x3. Add CCM support. This requires changes to the configuration and adding,
//  modifying or replacing existing tables to support more or all Timers
//  and their associated GPIOs.
// 4. Add multi-channel support. Allow all timer channels to be used for input.
// 5. Support Tim1 and Tim8? These have more complex IRQ requirements.
// 6. For 16-bit timers, allow with configuration to include SLOW, MED and
//  FAST options to reduce the effects of the 65,536 count rollover.
// 7. Add syscalls as needed (probably 2 maybe 3)
// 8. Test unconfigure code (need syscall?)
// 9. Clean up code, remove unneeded header includes and retest code

/****************************************************************************
 * Included Files
 ****************************************************************************/
// Consider removing this and always build
#define MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD (1)

#if MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD > 0

// WHAT HEADER FILES ARE REALLY NEEDED?
#include <nuttx/config.h>
#include <arch/board/board.h>

#include <string.h>
#include <stdbool.h>
#include <assert.h>
#include <debug.h>
#include <errno.h>

#include "chip.h"
#include "fcntl.h"
#include <nuttx/semaphore.h>
#include <nuttx/arch.h>

#include "stm32f777zit6-meadow.h"

#include <sys/ioctl.h>
#include <nuttx/timers/timer.h>
#include "stm32_tim.h"
#include "stm32_gpio.h"
#include <meadow/meadow_hw_version.h>
#include <meadow/hcom_shared_common.h>
#include <stdlib.h>

#include "specialized/meadow_measure_freq.h"

// Diagnostic
#pragma GCC optimize("O0")    // Prevent compiler from changing the code
#pragma message "(--) meadow_measure_freq.c"
// Diagnostic

//=====================================================
// Diagnostic only
// #define USE_MEADOW_DEBUG_HELPERS
// #undef USE_MEADOW_DEBUG_HELPERS
// #include <meadow/meadow_debug_helpers.h>
#define DEBUG_PIN_V2_D05  (GPIO_OUTPUT | GPIO_FLOAT | GPIO_PUSHPULL | GPIO_SPEED_100MHz | GPIO_PORTB | GPIO_PIN4)
#define DEBUG_PIN_V2_D06  (GPIO_OUTPUT | GPIO_FLOAT | GPIO_PUSHPULL | GPIO_SPEED_100MHz | GPIO_PORTB | GPIO_PIN13)
// Diagnostic only

//=====================================================
#define MEADOW_FREQ_MAX_TIMER_CHANNELS     (4)
#define MEADOW_FREQ_TIMER_WIDTH_16         (0)
#define MEADOW_FREQ_TIMER_WIDTH_32         (1)
#define MEADOW_FREQ_16_BIT_OVERFLOW_COUNT  (65536)
#define MEADOW_FREQ_32_BIT_OVERFLOW_COUNT  (4294967296)

#define MEADOW_FREQ_SYNC_STATE_UNKNOWN     (100)
#define MEADOW_FREQ_SYNC_STATE_ERROR       (101)
#define MEADOW_FREQ_SYNC_STATE_LEADING     (102)
#define MEADOW_FREQ_SYNC_STATE_TRAILING    (103)

// To configure a GPIO as an input to a timer it, needs to contain the how it
// will be used (input with pulldown), Pin and Port, the Timer defined
// alternate function value plus the Nuttx GPIO_ALT value.
#define MEADOW_TIMER_GPIO_CONST (GPIO_ALT | GPIO_INPUT | GPIO_PULLDOWN)

/****************************************************************************
 * Private Data
 ****************************************************************************/
// This array contains timer information most of which is fixed by the STM32F7
// hardware. It contains each F7 timer and a flag for useability (TIM1 and
// TIM8 are not usable). The 'chn' (i.e. inputTimerChan) byte contains 4 bits
// that represent active/inuse channels by the timer.
static mdwFreqTimerInfo_t mdwFreqTimerInfoArray[] = 
{
            //   |--- bit-field---|
            //   #  wid max apb use    Base Addr       Clk Timer Enable      IRQ Vector    Alt Func chn Chan1 Chan2 Chan3 Chan4
  /* TIM1   */  {1 , 0,  1,  0, 0, STM32_TIM1_BASE,  0,                   0,               GPIO_AF1, 0, {NULL, NULL, NULL, NULL}},
  /* TIM2   */  {2 , 1,  0,  0, 1, STM32_TIM2_BASE,  RCC_APB1ENR_TIM2EN,  STM32_IRQ_TIM2,  GPIO_AF1, 0, {NULL, NULL, NULL, NULL}},
  /* TIM3   */  {3 , 0,  0,  0, 1, STM32_TIM3_BASE,  RCC_APB1ENR_TIM3EN,  STM32_IRQ_TIM3,  GPIO_AF2, 0, {NULL, NULL, NULL, NULL}},
  /* TIM4   */  {4 , 0,  0,  0, 1, STM32_TIM4_BASE,  RCC_APB1ENR_TIM4EN,  STM32_IRQ_TIM4,  GPIO_AF2, 0, {NULL, NULL, NULL, NULL}},
  /* TIM5   */  {5 , 1,  0,  0, 1, STM32_TIM5_BASE,  RCC_APB1ENR_TIM5EN,  STM32_IRQ_TIM5,  GPIO_AF2, 0, {NULL, NULL, NULL, NULL}},
  /* TIM8   */  {8 , 0,  1,  0, 0, STM32_TIM8_BASE,  0,                   0,               GPIO_AF3, 0, {NULL, NULL, NULL, NULL}},
  /* TIM9   */  {9 , 0,  1,  1, 1, STM32_TIM9_BASE,  RCC_APB2ENR_TIM9EN,  STM32_IRQ_TIM9,  GPIO_AF3, 0, {NULL, NULL, NULL, NULL}},
  /* TIM10  */  {10, 0,  1,  1, 1, STM32_TIM10_BASE, RCC_APB2ENR_TIM10EN, STM32_IRQ_TIM10, GPIO_AF3, 0, {NULL, NULL, NULL, NULL}},
  /* TIM11  */  {11, 0,  1,  1, 1, STM32_TIM11_BASE, RCC_APB2ENR_TIM11EN, STM32_IRQ_TIM11, GPIO_AF3, 0, {NULL, NULL, NULL, NULL}},
  /* TIM12  */  {12, 0,  0,  0, 1, STM32_TIM12_BASE, RCC_APB1ENR_TIM12EN, STM32_IRQ_TIM12, GPIO_AF9, 0, {NULL, NULL, NULL, NULL}},
  /* TIM13  */  {13, 0,  0,  0, 1, STM32_TIM13_BASE, RCC_APB1ENR_TIM13EN, STM32_IRQ_TIM13, GPIO_AF3, 0, {NULL, NULL, NULL, NULL}},
  /* TIM14  */  {14, 0,  0,  0, 1, STM32_TIM14_BASE, RCC_APB1ENR_TIM14EN, STM32_IRQ_TIM14, GPIO_AF9, 0, {NULL, NULL, NULL, NULL}}
};

#define MEADOW_FREQ_TOTAL_TIMERS_AVAILABLE (sizeof(mdwFreqTimerInfoArray)/sizeof(mdwFreqTimerInfo_t))

//----------------------------------------------------------------------------
// This table contains all of the STM32F7's timers and their valid GPIOs and
// channel. It is used for F7v1 and F7v2 and CCM. It should be able to verify
// any timer GPIO combination with an STM32F7 MCU.
//
// Notes: related to GPIO Input implementation
// Only timers with GPIO are considered this removes TIM6 and TIM7
// Advanced timer (TIM1 and TIM8) are not included because they have a more
//  complex interrupt structure, this simplified implementation. And TIM1
//  has no GPIO exposed on F7FeatherV1 or F7FeatherV2.
// TIM2 is hard wired to the tri-color LEDs on F7FeatherV1 and F7FeatherV2.
//   But, included for possible CCM use.
// TIM13 has no GPIO exposed on F7FeatherV1 or F7FeatherV2. But, included for
//   possible CCM use.
// TIM14 only has one GPIO exposed on F7FeatherV1. But, included for possible
//   CCM use.
mdwFreqChanPortPin_t validStm32F7GpioArray[][11] = 
{
// Tim
//  1   PA8         PE9        PA9        PE11      PA10,      PE13,      PA11,      PE14
      {{0x08, 1}, {0x49, 1}, {0x09, 2}, {0x4b, 2}, {0x0a, 3}, {0x4d, 3}, {0x0b, 4}, {0x4e, 4}, {0xff, 0}},
//  2    PA0,      PA15,       PA1,       PB3,       PA2,      PB10,       PA3,      PB11
      {{0x00, 1}, {0x0f, 1}, {0x01, 2}, {0x13, 2}, {0x02, 3}, {0x1a, 3}, {0x03, 4}, {0x1b, 4}, {0xff, 0}},
//  3    PA6        PC6        PB4,       PA7        PC7,       PB5,       PB0        PC8,       PB1        PC9
      {{0x06, 1}, {0x26, 1}, {0x14, 1}, {0x07, 2}, {0x27, 2}, {0x15, 2}, {0x10, 3}, {0x28, 3}, {0x11, 4}, {0x29, 4}, {0xff, 0}},
//  4    PD12       PB6        PD13       PB7        PD14,      PB8        PD15       PB9
      {{0x3c, 1}, {0x16, 1}, {0x3d, 2}, {0x17, 2}, {0x3e, 3}, {0x18, 3}, {0x3f, 4}, {0x19, 4}, {0xff, 0}},
//  5    PA0        PH10       PA1        PH11       PA2        PH12,      PA3,       PI0},
      {{0x00, 1}, {0x7a, 1}, {0x01, 2}, {0x7b, 2}, {0x02, 3}, {0x7c, 3}, {0x03, 4}, {0x80, 4}, {0xff, 0}},
//  6  No GPIO
      {{0xff, 0}},
//  7  No GPIO
      {{0xff, 0}},
//  8    PC6        PI5        PC7        PI6        PC8        PI7        PC9        PI2
      {{0x26, 1}, {0x85, 1}, {0x27, 2}, {0x86, 2}, {0x28, 3}, {0x87, 3}, {0x29, 4}, {0x82, 4}, {0xff, 0}},
//  9    PE5        PA2        PE6        PA3
      {{0x45, 1}, {0x02, 1}, {0x46, 2}, {0x03, 2}, {0xff, 0}},
// 10    PF6        PB8
      {{0x56, 1}, {0x18, 1}, {0xff, 0}},
// 11    PF7        PB9
      {{0x57, 1}, {0x19, 1}, {0xff, 0}},
// 12    PH6        PB14       PH9        PB15
      {{0x76, 1}, {0x1e, 1}, {0x79, 2}, {0x1f, 2}, {0xff, 0}},
// 13    PF8        PA6
      {{0x58, 1}, {0x06, 1}, {0xff, 0}},
// 14    PF9        PA7
      {{0x59, 1}, {0x07, 1}, {0xff, 0}},
};

// Used to verify pin and port availability on F7v1
static uint8_t validF7v1GpioArray[][5] =
{
  // F7v1
  /* TIM1  GPIO NOT EXPOSED     */ {0xff},
  /* TIM2  GPIO NOT EXPOSED     */ {0xff},
  /* TIM3  D02, D05, D06, D09   */ {0x26,0x27,0x10,0x11,0xff},
  /* TIM4  D08, D07, D03*, D04* */ {0x16,0x17,0x18,0x19,0xff},
  /* TIM5  D10,                 */ {0x7a,0xff},
  /* TIM6 GPIO NOT EXPOSED      */ {0xff},
  /* TIM7 GPIO NOT EXPOSED      */ {0xff},
  /* TIM8 GPIO NOT EXPOSED      */ {0xff,0xff},
  /* TIM9  A02,                 */ {0x03,0xff},
  /* TIM10 D03*,                */ {0x18,0xff},
  /* TIM11 D04*,                */ {0x19,0xff},
  /* TIM12 D12, D13             */ {0x1e,0x1e,0xff},
  /* TIM13 GPIO NOT EXPOSED     */ {0xff},
  /* TIM14 A03,                 */ {0x07,0xff}
};

// Used to verify pin and port availability on F7v2
static uint8_t validF7v2GpioArray[][5] =
{
  // F7v2
  /* TIM1  GPIO NOT EXPOSED     */ {0xff},
  /* TIM2  GPIO NOT EXPOSED     */ {0xff},
  /* TIM3  D05, D10, A03, A04   */ {0x14,0x27,0x10,0x11,0xff},
  /* TIM4  D08, D07, D03*, D04* */ {0x16,0x17,0x18,0x19,0xff},
  /* TIM5  D02,            A02  */ {0x7a,0x03,0xff},
  /* TIM6  GPIO NOT EXPOSED     */ {0xff},
  /* TIM7  GPIO NOT EXPOSED     */ {0xff},
  /* TIM8  GPIO NOT EXPOSED     */ {0xff},
  /* TIM9  GPIO NOT EXPOSED     */ {0xff},
  /* TIM10 D03*                 */ {0x18,0xff},
  /* TIM11 D04*                 */ {0x19,0xff},
  /* TIM12 D12, D13             */ {0x1e,0x1f,0xff},
  /* TIM13 GPIO NOT EXPOSED     */ {0xff},
  /* TIM14 GPIO NOT EXPOSED     */ {0xff}
};

/************************************************************************************
 * Private Function Prototypes
 ************************************************************************************/

static int meadow_measure_freq_cfg_timer_hardware(mdwFreqTimerInfo_t *mdwFreqTimerInfo,
            int inputTimerChan, bool configure);
static int meadow_measure_freq_isr(int irq, void *context, void *arg);

/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/
// This ISR is called for all frequency measurement interrupts.
// There is a unique ISR vector for each timer. But, each timer must process
// 1 - 4 inputs. On entry we don't know which input(s) is/are involved.
//

// Note: a 16-bit register at 96 MHz will overflow every 683 microseconds.
int meadow_measure_freq_isr(int irq, void *context, void *arg)
{
  // (--) Diag
  stm32_gpiowrite(DEBUG_PIN_V2_D06, true);

  mdwFreqTimerInfo_t *mdwFreqTimerInfo = (mdwFreqTimerInfo_t *)arg;
  uint32_t timerBase = mdwFreqTimerInfo->timerBase;
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  // Only monitoring rising edges for now
  if(timStatusReg & GTIM_SR_UIF)
  {
    // (--) Don't clear yet. Need to determine if count is reset when
    // edge is encountered.
    // timStatusReg &= ~GTIM_SR_UIF;

