WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
    // Assume CNT register overflowed. This means we must add 1 to all active
    // overflow values.
    uint8_t chanBits = mdwFreqTimerInfo->chanActiveBits;
    for(int i = 0; i < 4; i++)
    {
      if(chanBits & 0b00000001)
      {
        // Channel is active
        mdwFreqRtData_t *mdwFreqRtData = mdwFreqTimerInfo->mdwFreqRtData[i];
        mdwFreqRtData->leadToLeadOverflow++;
      }
      chanBits = chanBits >> 1;
    }
  }

  //----------------------------------------------------------
  // Channel 1
  if(timStatusReg & GTIM_SR_CC1IF)
  {
    timStatusReg &= ~GTIM_SR_CC1IF;

    mdwFreqRtData_t *mdwFreqRtData = 
              mdwFreqTimerInfo->mdwFreqRtData[FREQ_RT_DATA_OFFSET_CHAN_1];
    if(mdwFreqRtData == NULL)
    {
      syslog(1, "%s@%d-Channel 1-mdwFreqRtData is NULL in ISR\n", __FILE__, __LINE__);
      return -ERROR;  // -1
    }

    // Save the capture/compare register snap shot for this channel
    // THIS IS A 32-BIT REGISTER FOR TIM5 (AND THAT'S WHAT I'M TESTING)
    // (--) Does this work correctly with a 16-bit register?
    uint32_t currentCount = 0;
    if(mdwFreqTimerInfo->timerWidth)
    {
      // 32-bit register
      currentCount = getreg32(timerBase + STM32_GTIM_CCR1_OFFSET);
      // Account for rollover
      if(mdwFreqRtData->countPrevious > currentCount)
      {
        mdwFreqRtData->leadToLeadOverflow += MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
      }
    }
    else
    {
      // 16-bit register
      currentCount = getreg16(timerBase + STM32_GTIM_CCR1_OFFSET);
      // Account for rollover
      if(mdwFreqRtData->countPrevious > currentCount)
      {
        mdwFreqRtData->leadToLeadOverflow += MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;
      }
    }

    mdwFreqRtData->countLeadToLead = currentCount - mdwFreqRtData->countPrevious;
    mdwFreqRtData->countPrevious = currentCount;

    // Add current to total timer count for frequency average and
    // increment the GPIO input change count.
    mdwFreqRtData->countTimerTotal += mdwFreqRtData->countLeadToLead;
    mdwFreqRtData->countInputTotal++;
  }

  // Clear the status register
  timStatusReg &= ~GTIM_SR_CC1IF;
  timStatusReg &= ~GTIM_SR_CC2IF;
  timStatusReg &= ~GTIM_SR_CC3IF;
  timStatusReg &= ~GTIM_SR_CC4IF;
  timStatusReg &= ~GTIM_SR_UIF;
  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

  // (--) Diag
  stm32_gpiowrite(DEBUG_PIN_V2_D06, false);

  return OK;
}

//=============================================================
static uint32_t meadow_measure_freq_get_apb_clock(
          mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  if(mdwFreqTimerInfo->timerAPBClk)
    return STM32_RCC_APB2ENR;
  else
    return STM32_RCC_APB1ENR;
}

//=============================================================
// Uses the bit-field to determine the Timer clock
static uint32_t meadow_measure_freq_get_max_clock(
          const mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  if(mdwFreqTimerInfo->timerMaxClk)
    return STM32_APB2_TIM1_CLKIN;
  else
    return STM32_APB1_TIM2_CLKIN;
}

//=============================================================
static void meadow_measure_freq_disable(const uint32_t timerBase)
{
  uint16_t regval = getreg16(timerBase + STM32_BTIM_CR1_OFFSET);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, timerBase + STM32_BTIM_CR1_OFFSET);
}

//=============================================================
static void meadow_measure_freq_enable(const uint32_t timerBase)
{
  // Enable timer Counter
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  
  // Re-initialize the counter and generates an update of the registers
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);
  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

//=====================================================================
// The following finds the specified timer's built-in timer information.
mdwFreqTimerInfo_t *meadow_measure_freq_get_timer_info(const int timerNumb)
{
  mdwFreqTimerInfo_t *timerInfo = &(mdwFreqTimerInfoArray[timerNumb - 1]);

  if(timerInfo->timerUsable)
    return timerInfo;

  return NULL;
}

//=====================================================================
// Returns the correct bit field definition based on the channel
uint8_t meadow_measure_freq_get_chan_bit_field(const int timerChan)
{
  switch(timerChan)
  {
    case 1:
      return ACTIVE_CHAN_BITFIELD_1;
      break;
    case 2:
      return ACTIVE_CHAN_BITFIELD_2;
      break;
    case 3:
      return ACTIVE_CHAN_BITFIELD_3;
      break;
    case 4:
      return ACTIVE_CHAN_BITFIELD_4;
      break;
    default:
      return 0;
  }
}

//=============================================================
// This function will evaluate the GPIO based on 3 tables that contain the
// legal GPIOs for the CCM (all F7 GPIOs checked) and for F7v1 and F7v2.
//
// Returns the channel, 1-4 unless not found, then returns 0.
static uint8_t meadow_measure_freq_get_chan_from_tim_port_pin(const int timerNumb,
          uint8_t portAndPin)
{
  int entry;
  int timerOffset = timerNumb - 1;

  if(meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V1)
  {
    // Verify pin & port are valid for FeatherV1 hardware
    entry = 0;
    while(validF7v1GpioArray[timerOffset][entry] != 0xff)
    {
      if(portAndPin == validF7v1GpioArray[timerOffset][entry])
      {
        syslog(1, "%s@%d- V1 so far good\n", __FILE__, __LINE__);
      }
      entry++;
    }
    if(validF7v1GpioArray[timerOffset][entry] == 0xff)
     return 0;
  }
  else if (meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V2)
  {
    // Verify pin & port are valid for FeatherV2 hardware
    entry = 0;
    while(validF7v2GpioArray[timerOffset][entry] != 0xff)
    {
      if(portAndPin == validF7v2GpioArray[timerOffset][entry])
      {
        break;    // So far good
      }
      entry++;
    }
    
    if(validF7v2GpioArray[timerOffset][entry] == 0xff)
      return 0;
  }
  else if (meadow_hw_version_get() != MEADOW_F7_HW_VERSION_NUMB_CCMV2)
  {
    // Unsupported device type
    syslog(1, "%s@%d- Unknown device type\n", __FILE__, __LINE__);
    return 0;
  }

  // All hardware types reach here to find the timer channel and verify the
  // pin and port are legal.
  entry = 0;
  while(validStm32F7GpioArray[timerOffset][entry].portPin != 0xff)
  {
    if(portAndPin == validStm32F7GpioArray[timerOffset][entry].portPin)
    {
      // Found valid channel
      return validStm32F7GpioArray[timerOffset][entry].chan;
    }
    entry++;
  }

  return 0; // Channel not found
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called by Meadow.Core to configure
// Timer numbers range from 1 - 14. However, some are not defined.
int meadow_measure_freq_configure(const int timerNumber, int timerChannel,
          const uint8_t portAndPin)
{
  int ret;
  int channelOffset = timerChannel - 1;
  uint32_t inputGpioConfig;
  static bool firstTime = true;

  if(firstTime)
  {
    firstTime = false;

