WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
    // (--) Diag config LED
    stm32_configgpio(DEBUG_PIN_V2_D06);
    // (--) Diag LED
  }

  if(timerNumber > 14 || timerNumber < 1)
  {
    syslog(2, "%s@%d-Timer must be 1 - 14\n", __FILE__, __LINE__);
    return -ENOTSUP;
  }
  
  if(timerChannel > 4 || timerChannel < 1)
  {
    syslog(2, "%s@%d-Channel must be 1 - 4\n", __FILE__, __LINE__);
    return -ENOTSUP;
  }

  // Insure a correct timer / pin+port combination was supplied.
  // Timers have, at most, 1-4 channels, each representing 1 GPIO. For the
  // specified timer we need to verify a proper port and pin.
  uint8_t validatedTimerChan = meadow_measure_freq_get_chan_from_tim_port_pin(
            timerNumber, portAndPin);
  if(validatedTimerChan == 0)
  {
    syslog(2, "%s@%d-The Port and Pin, not valid for timer %d\n",
              __FILE__, __LINE__, timerNumber);
    return -ENOTSUP;
  }

  // Is this a valid combination for an STM32F7?
  if(timerChannel != validatedTimerChan)
  {
    syslog(2, "%s@%d-The Port/Pin/Timer/Channel combination, not valid\n",
              __FILE__, __LINE__);
    return -ENOTSUP;
  }

  // Check if this timer is useable
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_get_timer_info(timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Timer %ld cannot be used\n",
              __FILE__, __LINE__, timerNumber);
    return -ENOTSUP;
  }

// TODO - Add unconfigure for channel reuse
  // This timer is usable, but is this channel already being used?
  uint8_t chanBits = meadow_measure_freq_get_chan_bit_field(timerChannel);
  if(mdwFreqTimerInfo->chanActiveBits & chanBits)
  {
    syslog(LOG_ERR, "%s@%d-Timer %d, channel %d in use\n",
              __FILE__, __LINE__, timerNumber, timerChannel);
    return -EADDRINUSE;
  }

  // Build the input configuration for Nuttx
  inputGpioConfig = MEADOW_TIMER_GPIO_CONST | portAndPin | \
            mdwFreqTimerInfo->timerAltFunc;

  // Diagnostic
  // syslog(1, "%s@%d-input Pin defn:0x%02x (P%c%d), Pin defn + AF:0x%08lx\n",
  //           __FILE__, __LINE__, portAndPin,
  //           ((portAndPin) >> 4) + 'A', portAndPin & 0x0f, inputGpioConfig);
  // Diagnostic

  // Allocate a struct for each new timer / input channel pair
  mdwFreqTimerInfo->mdwFreqRtData[channelOffset] = (mdwFreqRtData_t*)zalloc(sizeof(mdwFreqRtData_t));
  if(mdwFreqTimerInfo->mdwFreqRtData[channelOffset] == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Allocation for mdwFreqRtData_s NULL\n", __FILE__, __LINE__);
    return -ENOMEM;
  }

  // Valid GPIO so configure input point for timer.
  ret = stm32_configgpio(inputGpioConfig);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:stm32_configgpio() returned:%ld\n",
              __FILE__, __LINE__, ret);
    free(mdwFreqTimerInfo->mdwFreqRtData[channelOffset]);
    return -ENOTSUP;   // Not supported
  }

  // Initialized the F7's timer hardware
  ret = meadow_measure_freq_cfg_timer_hardware(mdwFreqTimerInfo, validatedTimerChan,
            true);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Meadow frequency init failed:%d\n",
              __FILE__, __LINE__, ret);
    free(mdwFreqTimerInfo->mdwFreqRtData[channelOffset]);
    return ret;
  }

  // Start filling the channel structure
  mdwFreqTimerInfo->mdwFreqRtData[channelOffset]->activeState     = MEADOW_FREQ_SYNC_STATE_UNKNOWN;
  mdwFreqTimerInfo->mdwFreqRtData[channelOffset]->inputConfig     = inputGpioConfig;
  mdwFreqTimerInfo->mdwFreqRtData[channelOffset]->inputTimerChan  = validatedTimerChan;
  mdwFreqTimerInfo->mdwFreqRtData[channelOffset]->countInputTotal = 0;
  mdwFreqTimerInfo->mdwFreqRtData[channelOffset]->countTimerTotal = 0;
  mdwFreqTimerInfo->chanActiveBits |= chanBits;
  return OK;
}

//=============================================================
// Frequency (and duty cycle) configuration of timer registers.
// It will configure and unconfigure 
int meadow_measure_freq_cfg_timer_hardware(
          mdwFreqTimerInfo_t *mdwFreqTimerInfo,
          int inputTimerChan, bool configure)
{
  int ret;
  uint16_t regVal16;
  uint32_t regVal32;
  uint32_t dierBits = 0;
  uint32_t channelOffset = inputTimerChan - 1;

  if(mdwFreqTimerInfo == NULL)
    return -ENXIO;

  // mdwFreqRtData_t *chanRtData = mdwFreqTimerInfo->mdwFreqRtData[channelOffset];
  uint32_t timerBase = mdwFreqTimerInfo->timerBase;
  
  // Before starting disable capture/control for all channels. Ref Man (26.4.7 at
  // end) "Note: CC1S bits are writable only when the channel is OFF (i.e.
  // CC1E = 0 in TIMx_CCER)."
  regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  regVal16 &= 0xeeee;   // e = 1110, clear CCxE bits 0, 4, 8 & 12
  putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);
  
  // Set the input triggers, rising, falling or both for channel by
  // setting the CCxP and CCXNP bits in the CCER
  regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  regVal32 = 0;   // For input 1 & 2, Input Capture Filters [15:12] & [7:4]
  // and Input Capture Prescaler [9:8] & [1:0] are disabled by setting to 0.

  // Connect each input to it's logical capture/compare register
  switch(inputTimerChan)
  {
    case 1:
      // 01: IC1 is mapped on TI1
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
      regVal32 |= 0x00000001;       // 1 = 01, set bits 1:0
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

      regVal16 &= ~(GTIM_CCER_CC1P | GTIM_CCER_CC1NP);     // 00 rising only
      dierBits |= GTIM_DIER_CC1IE;
      break;

    case 2:
      // 01: IC2 is mapped on TI2
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
      // GTIM_CCMR1_CC1S_SHIFT
      regVal32 |= 0x00000100;   // 0x0100 = 0100, set bits 9:8
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

      regVal16 &= ~(GTIM_CCER_CC2P | GTIM_CCER_CC2NP);     // 00 rising only
      dierBits |= GTIM_DIER_CC2IE;
      break;

    case 3:
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET);
      // 01: IC3 is mapped on TI3
      regVal32 |= 0x00000001;   // 1 = 01, set bits 1:0
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR2_OFFSET);

      regVal16 &= ~(GTIM_CCER_CC3P | GTIM_CCER_CC3NP);     // 00 rising only
      dierBits |= GTIM_DIER_CC3IE;
      break;

    case 4:
      regVal32 = getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET);
      // 01: IC4 is mapped on TI4
      regVal32 |= 0x00000100;   // 0x0100 = 0100, set bits 9:8
      putreg32(regVal32, timerBase + STM32_GTIM_CCMR2_OFFSET);

      regVal16 &= ~(GTIM_CCER_CC4P | GTIM_CCER_CC4NP);     // 00 rising only
      dierBits |= GTIM_DIER_CC4IE;
      break;

    default:
      return -ENODEV;   // No such device
  }

